function i=findspan(U,p,u)

%============  求参数点u 所在的节点张成区间；
%============  U 为开型节点向量，一个1*m的行向量；
m=length(U); %======== 节点向量中节点的总个数，U为开型节点向量，即首尾节点的重数为：p+1重；
n=m-p-1;%========= n为B样条基函数的个数；

if(u<U(1)||u>U(m))
    disp('it is error')
  return
end
if  u==U(n+1)
    i=n;
return
end
%================ 下面采用二分查找的方法来求出节点张成区间的指标i;============
low=p+1;
high=n+1;%==== 不能将high改为n;
mid=fix((high+low)/2);

while  u<U(mid) || u>=U(mid+1) 
	if u<U(mid)
        high=mid;
    else
        low=mid;
	end
mid=fix((high+low)/2);
end
i=mid;%———————————— 即参数点u在节点张成区间 [U(i),U(i+1))内；
end

%==========================================Test============================
% U=[0 0 0 1/2 1/2 2/3 2/3 1 1 1];
% u=1/2;
% p=2;
% i=findspan(U,p,u)
% the output is  ==== i=5; 
%==========================================================================
