function C=PointOnbspCurve(P,U,p,u)
%================计算B样条曲线在点u处的参数值C=(x(u);y(u))或者(x(u);y(u);z(u))；
% P为控制点构成的矩阵，[ndim,nknot]=size(P），其中，nknot为控制点的个数，即基函数的个数，ndim为控制点所在空间的维数；
%======== 即每一列存放的是一个控制点对应的坐标值，而列数就是控制点的总个数个数，即等于基函数的个数；P(:,i)=(x(i);y(i))or (x(i);y(i);z(i));
i=findspan(U,p,u);%------- 找出u所在的节点张成区间；
N=bsplinebasis(U,p,u);% ------ 为(p+1)维列向量；存储p+1个不为的基函数，即i-p,...,i个不为0的B-Spline 基函数；
%----------------- C=zeros(ndim,1);
C=P(:,i-p:i)*N;%=========控制点与对应非0的B-Spline  基函数作线性组合可求得点u在B样条曲线上的参数值，即坐标轴上的值，为列向量；


%% =======Test================
% P(:,1)=[0;1];P(:,2)=[1;1];P(:,3)=[1;0];
%或者控制点写为： P=[0,1,1;
%                   1,1,0 ];
% p=2;U=[0 0 0 1 1 1];u=1/2;
% C=PointOnbspCurve(P,U,p,u);
%======输出结果为
% C =
%   0.750000000000000
%   0.750000000000000
%%===========================