function s=Hammer_2d(f,np)
if nargin==1
np=7;
end

switch np
case 1 %=====参考单元为等腰直角三角形； 对完全一次多项式精确成立；
a=1/3;A1=1;
s=f(a,a,a)*A1;
case 3 %=====参考单元为等腰直角三角形； 对完全2次多项式精确成立；
	B1=1/3;
a=1/2;b=0;
s=B1*(f(a,a,b)+f(a,b,a)+f(b,a,a));
case 4  %=====参考单元为等腰直角三角形；4个积分节点，对3次 完全多项式精确成立；
	a=1/5;b=3/5;
A1=-27/48;B1=25/48;
s=A1*f(1/3,1/3,1/3)+B1*(f(a,a,b)+f(a,b,a)+f(b,a,a));
case 7  %=====参考单元为等腰直角三角形； 对5次 完全多项式精确成立；
a=0.1012865073;b=0.7974269853;c=0.4701420641;d=0.0597158717;
A1=0.225;B1=0.1259391805;C1=0.1323941527;
s=A1*f(1/3,1/3,1/3)+B1*(f(a,a,b)+f(a,b,a)+f(b,a,a))+C1*(f(c,c,d)+f(c,d,c)+f(d,c,c));
end
s=s/2;%======= 还要乘以参考单元的面积，为1/2;

end